[Killed] BlockStatement
ubuntu/wallaby-test-ts/src/lib.ts:1:49
-export function isSingleDigitExcept5(x: number) {
-    if (x >= 0 && x <= 9) {
-        return x != 5 ? true : false;
-    } else {
-        return false;
-    }
-}
+export function isSingleDigitExcept5(x: number) {}
 

[Killed] LogicalOperator
ubuntu/wallaby-test-ts/src/lib.ts:2:9
 export function isSingleDigitExcept5(x: number) {
-    if (x >= 0 && x <= 9) {
+    if (x >= 0 || x <= 9) {
         return x != 5 ? true : false;
     } else {

[Killed] EqualityOperator
ubuntu/wallaby-test-ts/src/lib.ts:3:16
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
-        return x != 5 ? true : false;
+        return x == 5 ? true : false;
     } else {
         return false;

[Killed] BooleanLiteral
ubuntu/wallaby-test-ts/src/lib.ts:3:25
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
-        return x != 5 ? true : false;
+        return x != 5 ? false : false;
     } else {
         return false;

[Killed] BlockStatement
ubuntu/wallaby-test-ts/src/lib.ts:4:12
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
         return x != 5 ? true : false;
-    } else {
-        return false;
-    }
+    } else {}
 }
 
