[Killed] BlockStatement
ubuntu/wallaby-test-ts/src/lib.ts:1:49
-export function isSingleDigitExcept5(x: number) {
-    if (x >= 0 && x <= 9) {
-        return x != 5;
-    } else {
-        return false;
-    }
-}
+export function isSingleDigitExcept5(x: number) {}
 

[Killed] ConditionalExpression
ubuntu/wallaby-test-ts/src/lib.ts:2:19
 export function isSingleDigitExcept5(x: number) {
-    if (x >= 0 && x <= 9) {
+    if (x >= 0 && false) {
         return x != 5;
     } else {

[Killed] EqualityOperator
ubuntu/wallaby-test-ts/src/lib.ts:2:19
 export function isSingleDigitExcept5(x: number) {
-    if (x >= 0 && x <= 9) {
+    if (x >= 0 && x > 9) {
         return x != 5;
     } else {

[Killed] EqualityOperator
ubuntu/wallaby-test-ts/src/lib.ts:3:16
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
-        return x != 5;
+        return x == 5;
     } else {
         return false;

[Killed] ConditionalExpression
ubuntu/wallaby-test-ts/src/lib.ts:3:16
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
-        return x != 5;
+        return false;
     } else {
         return false;

[Killed] BlockStatement
ubuntu/wallaby-test-ts/src/lib.ts:4:12
 export function isSingleDigitExcept5(x: number) {
     if (x >= 0 && x <= 9) {
         return x != 5;
-    } else {
-        return false;
-    }
+    } else {}
 }
 
